app/controllers/countries_controller.rb

  def index
    @countries = City.find :all, :group => 'country', :order => 'country'
---
SELECT * FROM "countries" ORDER BY name