app/controllers/mentions_controller.rb

SELECT * FROM "cities" WHERE ("cities"."name" = 'New York') LIMIT 1
SELECT * FROM "phrases" WHERE ("phrases"."title" = 'flu') LIMIT 1
SELECT * FROM "countries" WHERE ("countries"."id" = 1004581944)
SELECT * FROM "mentions" WHERE ("mentions"."phrase_id" = 876313266 AND "mentions"."city_id" = 862199666 AND "mentions"."mentioned_at" BETWEEN '2009-03-09 00:00' AND '2009-03-09 23:59') ORDER BY mentioned_at
---
  def index
    @sample_date = params[:date] ? Date.parse(params[:date]) : Date.today
    @city = City.find :first, :conditions => {:name => params[:city]}
    @phrase = Phrase.find :first, :conditions => {:title => params[:phrase]}

    update(@phrase, @city, @sample_date) if params[:update]

    @location = get_location(@city.name, @city.country.name)

    day = "%02d" % @sample_date.day
    month = "%02d" % @sample_date.month
    year = @sample_date.year
    date_range_start = "#{year}-#{month}-#{day} 00:00"
    date_range_end = "#{year}-#{month}-#{day} 23:59"
    @mentions = Mention.find :all, :conditions => {:phrase_id => @phrase.id, :city_id => @city.id, :mentioned_at => (date_range_start..date_range_end)}, :order => :mentioned_at

SELECT * FROM "mentions" WHERE ("mentions"."link" = 'http://twitter.com/SESweeting/statuses/1297987683') LIMIT 1
SELECT * FROM "locations" WHERE ("locations"."name" = 'New York') LIMIT 1
SELECT * FROM "countries" WHERE ("countries"."id" = 1004581944)
INSERT INTO "locations" ("name", "latitude", "updated_at", "longitude", "created_at") VALUES('New York City', '40.7560540', '2009-03-09 01:28:01', '-73.9869510', '2009-03-09 01:28:01')
INSERT INTO "mentions" ("phrase_id", "updated_at", "exact_location", "mentioner", "link", "city_id", "mentioned_at", "created_at") VALUES(876313266, '2009-03-09 01:26:15', 'New York City', 'SESweeting (Sharri)', 'http://twitter.com/SESweeting/statuses/1297987683', 169199234, '2009-03-08 23:03:23', '2009-03-09 01:26:15')
UPDATE "mentions" SET "exact_location" = 'New York City', "mentioner" = 'SESweeting (Sharri)', "mentioned_at" = '2009-03-08 23:03:23', "updated_at" = '2009-03-09 02:04:41' WHERE "id" = 71847873
---
  def update(phrase, city, sample_date)
    require 'hpricot'
    require 'open-uri'

    location = get_location(city.name, city.country.name)

    search_radius = 10

    day = "%02d" % sample_date.day
    month = "%02d" % sample_date.month
    year = sample_date.year
    twitter_geo_search_url = "http://search.twitter.com/search.atom?q=#{phrase.search.gsub(' ', '%20')}&geocode=#{location.latitude}%2C#{location.longitude}%2C#{search_radius}km&rpp=100&since=#{year}-#{month}-#{day}&until=#{year}-#{month}-#{day}"
    begin
      tweet_doc = open(twitter_geo_search_url) { |f| Hpricot(f) }
    rescue
    end

    if tweet_doc
      tweets = tweet_doc.search('//entry')

      tweets.each do |tweet|
        link = tweet.search('//link')[0].attributes['href']
        mention = Mention.find (:first, :conditions => {:link => link}) || Mention.new
        mention.link = link
        mention.mentioner = tweet.search('//name').text
        mention.mentioned_at = tweet.search('//published').text
        mention.exact_location = tweet.search('//google:location').text
        get_location(mention.exact_location, city.country.name)
        mention.city = city
        mention.phrase = phrase
        mention.save