app/controllers/mentions_controller.rb

SELECT * FROM "histories" WHERE ("histories"."city_id" = 169199234 AND "histories"."phrase_id" = 876313266) ORDER BY last_get LIMIT 1
SELECT * FROM "mentions" WHERE ("mentions"."link" = 'http://twitter.com/origin05/statuses/1290754913') LIMIT 1
---
  def index
    @city = City.find :first, :conditions => {:name => params[:city]}
    @phrase = Phrase.find :first, :conditions => {:title => params[:phrase]}
    @location = get_location(@city.name, @city.country)

    # 30 day range centered on the current date
    range = 30
    @range_center = params[:date] ? Date.parse(params[:date]) : Date.today
    @range_start = @range_center - (range / 2)
    @range_end = @range_center + (range / 2)

    # Data is updated hourly for today
    last_update = History.find :first, :conditions => {:city_id => @city.id, :phrase_id => @phrase.id}, :order => :last_get
    update(@phrase, @city, @range_center) if params[:update] || !last_update || last_update.last_get < (Time.now - (60 * 60))

    @mentions = Mention.find :all, :select => "DATE(mentioned_at) as mentioned_at_date, mentioned_at, mentioner, link, exact_location", :group => 'mentioner, mentioned_at_date', :conditions => {:phrase_id => @phrase.id, :city_id => @city.id, :mentioned_at => ("#{@range_start.year}-#{@range_start.month.to_s.rjust(2, '0')}-#{@range_start.day.to_s.rjust(2, '0')} 00:00".."#{@range_end.year}-#{@range_end.month.to_s.rjust(2, '0')}-#{@range_end.day.to_s.rjust(2, '0')} 23:59")}, :order => :mentioned_at