app/controllers/phrases_controller.rb

SELECT * FROM "phrases" ORDER BY title
---
  def index
    @phrases = Phrase.find :all, :order => 'title'